askn37/multix-zinnia-updi4avr-firmware-builder/boards.txt
tinyAVR012.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
tinyAVR012.bootloader.BOOTSIZE=0x02
tinyAVR012.bootloader.CODESIZE=0x00
tinyAVR012.bootloader.OSCCFG=0b01111110
tinyAVR012.bootloader.SYSCFG0=0b1111{bootloader.reset_bit}1{bootloader.eesave_bit}
tinyAVR012.bootloader.SYSCFG1=0b11111111
tinyAVR012.bootloader.WDTCFG=0b00000000
tinyAVR012.bootloader.bod_lvl=000
tinyAVR012.bootloader.bod_mode=00
tinyAVR012.bootloader.bod_sample=0
tinyAVR012.bootloader.eepupload=
tinyAVR012.bootloader.eesave_bit=1
tinyAVR012.bootloader.reset_bit=10
tinyAVR012.bootloader.tool=avrdude
tinyAVR012.bootloader.programed_type=.with_bootloader
tinyAVR012.build.export_merged_output=true
tinyAVR012.build.text_section_start=.text=0x200
tinyAVR012.build.buildopt=-DNDEBUG
tinyAVR012.build.console_baud=-DCONSOLE_BAUD=9600
tinyAVR012.build.led_pin=-DLED_BUILTIN=PIN_PA7
tinyAVR012.build.macroapi=-DENABLE_MACRO_API
tinyAVR012.build.printf=
tinyAVR012.build.printflt=
tinyAVR012.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p64.x
tinyAVR012.upload.protocol=arduino
tinyAVR012.upload.speed=115200
tinyAVR012.upload.tool=avrdude
tinyAVR012.menu.01_variant.01_ATtiny3227.build.board=AVR_ATTINY3227
tinyAVR012.menu.01_variant.01_ATtiny3227.build.mcu=attiny3227
tinyAVR012.menu.01_variant.01_ATtiny3227.build.variant=tinyAVR2_24
tinyAVR012.menu.01_variant.01_ATtiny3227.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p128.x
tinyAVR012.menu.01_variant.01_ATtiny3227.upload.maximum_data_size=3072
tinyAVR012.menu.01_variant.01_ATtiny3227.upload.maximum_size=32768
tinyAVR012.menu.01_variant.01_ATtiny3227=tinyAVR-2 24pin ATtiny3227 (32KiB+3KiB)
tinyAVR012.menu.01_variant.02_ATtiny1627.build.board=AVR_ATTINY1627
tinyAVR012.menu.01_variant.02_ATtiny1627.build.mcu=attiny1627
tinyAVR012.menu.01_variant.02_ATtiny1627.build.variant=tinyAVR2_24
tinyAVR012.menu.01_variant.02_ATtiny1627.upload.maximum_data_size=2048
tinyAVR012.menu.01_variant.02_ATtiny1627.upload.maximum_size=15872
tinyAVR012.menu.01_variant.02_ATtiny1627=tinyAVR-2 24pin ATtiny1627 (16KiB+2KiB)
tinyAVR012.menu.01_variant.03_ATtiny827.build.board=AVR_ATTINY827
tinyAVR012.menu.01_variant.03_ATtiny827.build.mcu=attiny827
tinyAVR012.menu.01_variant.03_ATtiny827.build.variant=tinyAVR2_24
tinyAVR012.menu.01_variant.03_ATtiny827.upload.maximum_data_size=1024
tinyAVR012.menu.01_variant.03_ATtiny827.upload.maximum_size=7680
tinyAVR012.menu.01_variant.03_ATtiny827=tinyAVR-2 24pin ATtiny827 (8KiB+1KiB)
tinyAVR012.menu.01_variant.04_ATtiny427.build.board=AVR_ATTINY427
tinyAVR012.menu.01_variant.04_ATtiny427.build.mcu=attiny427
tinyAVR012.menu.01_variant.04_ATtiny427.build.variant=tinyAVR2_24
tinyAVR012.menu.01_variant.04_ATtiny427.upload.maximum_data_size=512
tinyAVR012.menu.01_variant.04_ATtiny427.upload.maximum_size=3584
tinyAVR012.menu.01_variant.04_ATtiny427=tinyAVR-2 24pin ATtiny427 (4KiB+512B)
tinyAVR012.menu.01_variant.10=-
tinyAVR012.menu.01_variant.11_ATtiny3226.build.board=AVR_ATTINY3226
tinyAVR012.menu.01_variant.11_ATtiny3226.build.mcu=attiny3226
tinyAVR012.menu.01_variant.11_ATtiny3226.build.variant=tinyAVR2_20
tinyAVR012.menu.01_variant.11_ATtiny3226.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p128.x
tinyAVR012.menu.01_variant.11_ATtiny3226.upload.maximum_data_size=3072
tinyAVR012.menu.01_variant.11_ATtiny3226.upload.maximum_size=32768
tinyAVR012.menu.01_variant.11_ATtiny3226=tinyAVR-2 20pin ATtiny3226 (32KiB+3KiB)
tinyAVR012.menu.01_variant.12_ATtiny1626.build.board=AVR_ATTINY1626
tinyAVR012.menu.01_variant.12_ATtiny1626.build.mcu=attiny1626
tinyAVR012.menu.01_variant.12_ATtiny1626.build.variant=tinyAVR2_20
tinyAVR012.menu.01_variant.12_ATtiny1626.upload.maximum_data_size=2048
tinyAVR012.menu.01_variant.12_ATtiny1626.upload.maximum_size=15872
tinyAVR012.menu.01_variant.12_ATtiny1626=tinyAVR-2 20pin ATtiny1626 (16KiB+2KiB)
tinyAVR012.menu.01_variant.13_ATtiny826.build.board=AVR_ATTINY826
tinyAVR012.menu.01_variant.13_ATtiny826.build.mcu=attiny826
tinyAVR012.menu.01_variant.13_ATtiny826.build.variant=tinyAVR2_20
tinyAVR012.menu.01_variant.13_ATtiny826.upload.maximum_data_size=1024
tinyAVR012.menu.01_variant.13_ATtiny826.upload.maximum_size=7680
tinyAVR012.menu.01_variant.13_ATtiny826=tinyAVR-2 20pin ATtiny826 (8KiB+1KiB)
tinyAVR012.menu.01_variant.14_ATtiny426.build.board=AVR_ATTINY426
tinyAVR012.menu.01_variant.14_ATtiny426.build.mcu=attiny426
tinyAVR012.menu.01_variant.14_ATtiny426.build.variant=tinyAVR2_20
tinyAVR012.menu.01_variant.14_ATtiny426.upload.maximum_data_size=512
tinyAVR012.menu.01_variant.14_ATtiny426.upload.maximum_size=3584
tinyAVR012.menu.01_variant.14_ATtiny426=tinyAVR-2 20pin ATtiny426 (4KiB+512B)
tinyAVR012.menu.01_variant.20=-
tinyAVR012.menu.01_variant.21_ATtiny3224.build.board=AVR_ATTINY3224
tinyAVR012.menu.01_variant.21_ATtiny3224.build.mcu=attiny3224
tinyAVR012.menu.01_variant.21_ATtiny3224.build.variant=tinyAVR2_14
tinyAVR012.menu.01_variant.21_ATtiny3224.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p128.x
tinyAVR012.menu.01_variant.21_ATtiny3224.upload.maximum_data_size=3072
tinyAVR012.menu.01_variant.21_ATtiny3224.upload.maximum_size=32768
tinyAVR012.menu.01_variant.21_ATtiny3224=tinyAVR-2 14pin ATtiny3224 (32KiB+3KiB)
tinyAVR012.menu.01_variant.22_ATtiny1624.build.board=AVR_ATTINY1624
tinyAVR012.menu.01_variant.22_ATtiny1624.build.mcu=attiny1624
tinyAVR012.menu.01_variant.22_ATtiny1624.build.variant=tinyAVR2_14
tinyAVR012.menu.01_variant.22_ATtiny1624.upload.maximum_data_size=2048
tinyAVR012.menu.01_variant.22_ATtiny1624.upload.maximum_size=15872
tinyAVR012.menu.01_variant.22_ATtiny1624=tinyAVR-2 14pin ATtiny1624 (16KiB+2KiB)
tinyAVR012.menu.01_variant.23_ATtiny824.build.board=AVR_ATTINY824
tinyAVR012.menu.01_variant.23_ATtiny824.build.mcu=attiny824
tinyAVR012.menu.01_variant.23_ATtiny824.build.variant=tinyAVR2_14
tinyAVR012.menu.01_variant.23_ATtiny824.upload.maximum_data_size=1024
tinyAVR012.menu.01_variant.23_ATtiny824.upload.maximum_size=7680
tinyAVR012.menu.01_variant.23_ATtiny824=tinyAVR-2 14pin ATtiny824 (8KiB+1KiB)
tinyAVR012.menu.01_variant.24_ATtiny824.build.board=AVR_ATTINY424
tinyAVR012.menu.01_variant.24_ATtiny824.build.mcu=attiny424
tinyAVR012.menu.01_variant.24_ATtiny824.build.variant=tinyAVR2_14
tinyAVR012.menu.01_variant.24_ATtiny824.upload.maximum_data_size=512
tinyAVR012.menu.01_variant.24_ATtiny824.upload.maximum_size=3584
tinyAVR012.menu.01_variant.24_ATtiny824=tinyAVR-2 14pin ATtiny424 (4KiB+512B)
tinyAVR012.menu.01_variant.30=-
tinyAVR012.menu.01_variant.31_ATtiny3217.build.board=AVR_ATTINY3217
tinyAVR012.menu.01_variant.31_ATtiny3217.build.mcu=attiny3217
tinyAVR012.menu.01_variant.31_ATtiny3217.build.variant=tinyAVR1_24
tinyAVR012.menu.01_variant.31_ATtiny3217.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p128.x
tinyAVR012.menu.01_variant.31_ATtiny3217.upload.maximum_data_size=2048
tinyAVR012.menu.01_variant.31_ATtiny3217.upload.maximum_size=32768
tinyAVR012.menu.01_variant.31_ATtiny3217=tinyAVR-1 24pin ATtiny3217 (32KiB+2KiB)
tinyAVR012.menu.01_variant.32_ATtiny1617.build.board=AVR_ATTINY1617
tinyAVR012.menu.01_variant.32_ATtiny1617.build.mcu=attiny1617
tinyAVR012.menu.01_variant.32_ATtiny1617.build.variant=tinyAVR1_24
tinyAVR012.menu.01_variant.32_ATtiny1617.upload.maximum_data_size=2048
tinyAVR012.menu.01_variant.32_ATtiny1617.upload.maximum_size=15872
tinyAVR012.menu.01_variant.32_ATtiny1617=tinyAVR-1 24pin ATtiny1617 (16KiB+2KiB)
tinyAVR012.menu.01_variant.33_ATtiny817.build.board=AVR_ATTINY817
tinyAVR012.menu.01_variant.33_ATtiny817.build.mcu=attiny817
tinyAVR012.menu.01_variant.33_ATtiny817.build.variant=tinyAVR1_24
tinyAVR012.menu.01_variant.33_ATtiny817.upload.maximum_data_size=512
tinyAVR012.menu.01_variant.33_ATtiny817.upload.maximum_size=7680
tinyAVR012.menu.01_variant.33_ATtiny817=tinyAVR-1 24pin ATtiny817 (8KiB+512B)
tinyAVR012.menu.01_variant.34_ATtiny417.build.board=AVR_ATTINY417
tinyAVR012.menu.01_variant.34_ATtiny417.build.mcu=attiny417
tinyAVR012.menu.01_variant.34_ATtiny417.build.variant=tinyAVR1_24
tinyAVR012.menu.01_variant.34_ATtiny417.upload.maximum_data_size=256
tinyAVR012.menu.01_variant.34_ATtiny417.upload.maximum_size=3584
tinyAVR012.menu.01_variant.34_ATtiny417=tinyAVR-1 24pin ATtiny417 (4KiB+256B)
tinyAVR012.menu.01_variant.40=-
tinyAVR012.menu.01_variant.41_ATtiny3216.build.board=AVR_ATTINY3216
tinyAVR012.menu.01_variant.41_ATtiny3216.build.mcu=attiny3216
tinyAVR012.menu.01_variant.41_ATtiny3216.build.variant=tinyAVR1_20
tinyAVR012.menu.01_variant.41_ATtiny3216.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p128.x
tinyAVR012.menu.01_variant.41_ATtiny3216.upload.maximum_data_size=2048
tinyAVR012.menu.01_variant.41_ATtiny3216.upload.maximum_size=32768
tinyAVR012.menu.01_variant.41_ATtiny3216=tinyAVR-1 20pin ATtiny3216 (32KiB+2KiB)
tinyAVR012.menu.01_variant.42_ATtiny1616.build.board=AVR_ATTINY1616
tinyAVR012.menu.01_variant.42_ATtiny1616.build.mcu=attiny1616
tinyAVR012.menu.01_variant.42_ATtiny1616.build.variant=tinyAVR1_20
tinyAVR012.menu.01_variant.42_ATtiny1616.upload.maximum_data_size=2048
tinyAVR012.menu.01_variant.42_ATtiny1616.upload.maximum_size=15872
tinyAVR012.menu.01_variant.42_ATtiny1616=tinyAVR-1 20pin ATtiny1616 (16KiB+2KiB)
tinyAVR012.menu.01_variant.43_ATtiny816.build.board=AVR_ATTINY816
tinyAVR012.menu.01_variant.43_ATtiny816.build.mcu=attiny816
tinyAVR012.menu.01_variant.43_ATtiny816.build.variant=tinyAVR1_20
tinyAVR012.menu.01_variant.43_ATtiny816.upload.maximum_data_size=512
tinyAVR012.menu.01_variant.43_ATtiny816.upload.maximum_size=7680
tinyAVR012.menu.01_variant.43_ATtiny816=tinyAVR-1 20pin ATtiny816 (8KiB+512B)
tinyAVR012.menu.01_variant.44_ATtiny416.build.board=AVR_ATTINY416
tinyAVR012.menu.01_variant.44_ATtiny416.build.mcu=attiny416
tinyAVR012.menu.01_variant.44_ATtiny416.build.variant=tinyAVR1_20
tinyAVR012.menu.01_variant.44_ATtiny416.upload.maximum_data_size=256
tinyAVR012.menu.01_variant.44_ATtiny416.upload.maximum_size=3584
tinyAVR012.menu.01_variant.44_ATtiny416=tinyAVR-1 20pin ATtiny416 (4KiB+256B)
tinyAVR012.menu.01_variant.50=-
tinyAVR012.menu.01_variant.51_ATtiny1614.build.board=AVR_ATTINY1614
tinyAVR012.menu.01_variant.51_ATtiny1614.build.mcu=attiny1614
tinyAVR012.menu.01_variant.51_ATtiny1614.build.variant=tinyAVR1_14
tinyAVR012.menu.01_variant.51_ATtiny1614.upload.maximum_data_size=2048
tinyAVR012.menu.01_variant.51_ATtiny1614.upload.maximum_size=15872
tinyAVR012.menu.01_variant.51_ATtiny1614=tinyAVR-1 14pin ATtiny1614 (16KiB+2KiB)
tinyAVR012.menu.01_variant.52_ATtiny814.build.board=AVR_ATTINY814
tinyAVR012.menu.01_variant.52_ATtiny814.build.mcu=attiny814
tinyAVR012.menu.01_variant.52_ATtiny814.build.variant=tinyAVR1_14
tinyAVR012.menu.01_variant.52_ATtiny814.upload.maximum_data_size=512
tinyAVR012.menu.01_variant.52_ATtiny814.upload.maximum_size=7680
tinyAVR012.menu.01_variant.52_ATtiny814=tinyAVR-1 14pin ATtiny814 (8KiB+512B)
tinyAVR012.menu.01_variant.53_ATtiny414.build.board=AVR_ATTINY414
tinyAVR012.menu.01_variant.53_ATtiny414.build.mcu=attiny414
tinyAVR012.menu.01_variant.53_ATtiny414.build.variant=tinyAVR1_14
tinyAVR012.menu.01_variant.53_ATtiny414.upload.maximum_data_size=256
tinyAVR012.menu.01_variant.53_ATtiny414.upload.maximum_size=3584
tinyAVR012.menu.01_variant.53_ATtiny414=tinyAVR-1 14pin ATtiny414 (4KiB+256B)
tinyAVR012.menu.01_variant.70=-
tinyAVR012.menu.01_variant.71_ATtiny1607.build.board=AVR_ATTINY1607
tinyAVR012.menu.01_variant.71_ATtiny1607.build.mcu=attiny1607
tinyAVR012.menu.01_variant.71_ATtiny1607.build.variant=tinyAVR0_24
tinyAVR012.menu.01_variant.71_ATtiny1607.upload.maximum_data_size=1024
tinyAVR012.menu.01_variant.71_ATtiny1607.upload.maximum_size=15872
tinyAVR012.menu.01_variant.71_ATtiny1607=tinyAVR-0 24pin ATtiny1607 (16KiB+1KiB)
tinyAVR012.menu.01_variant.72_ATtiny807.build.board=AVR_ATTINY807
tinyAVR012.menu.01_variant.72_ATtiny807.build.mcu=attiny807
tinyAVR012.menu.01_variant.72_ATtiny807.build.variant=tinyAVR0_24
tinyAVR012.menu.01_variant.72_ATtiny807.upload.maximum_data_size=512
tinyAVR012.menu.01_variant.72_ATtiny807.upload.maximum_size=7680
tinyAVR012.menu.01_variant.72_ATtiny807=tinyAVR-0 24pin ATtiny807 (8KiB+512B)
tinyAVR012.menu.01_variant.80=-
tinyAVR012.menu.01_variant.81_ATtiny1606.build.board=AVR_ATTINY1606
tinyAVR012.menu.01_variant.81_ATtiny1606.build.mcu=attiny1606
tinyAVR012.menu.01_variant.81_ATtiny1606.build.variant=tinyAVR0_20
tinyAVR012.menu.01_variant.81_ATtiny1606.upload.maximum_data_size=1024
tinyAVR012.menu.01_variant.81_ATtiny1606.upload.maximum_size=15872
tinyAVR012.menu.01_variant.81_ATtiny1606=tinyAVR-0 20pin ATtiny1606 (16KiB+1KiB)
tinyAVR012.menu.01_variant.82_ATtiny806.build.board=AVR_ATTINY806
tinyAVR012.menu.01_variant.82_ATtiny806.build.mcu=attiny806
tinyAVR012.menu.01_variant.82_ATtiny806.build.variant=tinyAVR0_20
tinyAVR012.menu.01_variant.82_ATtiny806.upload.maximum_data_size=512
tinyAVR012.menu.01_variant.82_ATtiny806.upload.maximum_size=7680
tinyAVR012.menu.01_variant.82_ATtiny806=tinyAVR-0 20pin ATtiny806 (8KiB+512B)
tinyAVR012.menu.01_variant.83_ATtiny406.build.board=AVR_ATTINY406
tinyAVR012.menu.01_variant.83_ATtiny406.build.mcu=attiny406
tinyAVR012.menu.01_variant.83_ATtiny406.build.variant=tinyAVR0_20
tinyAVR012.menu.01_variant.83_ATtiny406.upload.maximum_data_size=256
tinyAVR012.menu.01_variant.83_ATtiny406.upload.maximum_size=3584
tinyAVR012.menu.01_variant.83_ATtiny406=tinyAVR-0 20pin ATtiny406 (4KiB+256B)
tinyAVR012.menu.01_variant.90=-
tinyAVR012.menu.01_variant.91_ATtiny1604.build.board=AVR_ATTINY1604
tinyAVR012.menu.01_variant.91_ATtiny1604.build.mcu=attiny1604
tinyAVR012.menu.01_variant.91_ATtiny1604.build.variant=tinyAVR0_14
tinyAVR012.menu.01_variant.91_ATtiny1604.upload.maximum_data_size=1024
tinyAVR012.menu.01_variant.91_ATtiny1604.upload.maximum_size=15872
tinyAVR012.menu.01_variant.91_ATtiny1604=tinyAVR-0 14pin ATtiny1604 (16KiB+1KiB)
tinyAVR012.menu.01_variant.92_ATtiny804.build.board=AVR_ATTINY804
tinyAVR012.menu.01_variant.92_ATtiny804.build.mcu=attiny804
tinyAVR012.menu.01_variant.92_ATtiny804.build.variant=tinyAVR0_14
tinyAVR012.menu.01_variant.92_ATtiny804.upload.maximum_data_size=512
tinyAVR012.menu.01_variant.92_ATtiny804.upload.maximum_size=7680
tinyAVR012.menu.01_variant.92_ATtiny804=tinyAVR-0 14pin ATtiny804 (8KiB+512B)
tinyAVR012.menu.01_variant.93_ATtiny404.build.board=AVR_ATTINY404
tinyAVR012.menu.01_variant.93_ATtiny404.build.mcu=attiny404
tinyAVR012.menu.01_variant.93_ATtiny404.build.variant=tinyAVR0_14
tinyAVR012.menu.01_variant.93_ATtiny404.upload.maximum_data_size=256
tinyAVR012.menu.01_variant.93_ATtiny404.upload.maximum_size=3584
tinyAVR012.menu.01_variant.93_ATtiny404=tinyAVR-0 14pin ATtiny404 (4KiB+256B)
tinyAVR012.menu.02_clock.01_20MHz.bootloader.bod_sample=0
tinyAVR012.menu.02_clock.01_20MHz.build.f_cpu=20000000L
tinyAVR012.menu.02_clock.01_20MHz=Internal 20 MHz
tinyAVR012.menu.02_clock.02_10MHz.bootloader.bod_sample=0
tinyAVR012.menu.02_clock.02_10MHz.build.f_cpu=10000000L
tinyAVR012.menu.02_clock.02_10MHz=Internal 10 MHz
tinyAVR012.menu.02_clock.03_5MHz.bootloader.bod_sample=0
tinyAVR012.menu.02_clock.03_5MHz.build.f_cpu=5000000L
tinyAVR012.menu.02_clock.03_5MHz=Internal 5 MHz
tinyAVR012.menu.02_clock.10=-
tinyAVR012.menu.02_clock.11_16MHz.bootloader.OSCCFG=0b00000001
tinyAVR012.menu.02_clock.11_16MHz.bootloader.bod_sample=0
tinyAVR012.menu.02_clock.11_16MHz.build.f_cpu=16000000L
tinyAVR012.menu.02_clock.11_16MHz=Internal 16 MHz
tinyAVR012.menu.02_clock.12_8MHz.bootloader.OSCCFG=0b00000001
tinyAVR012.menu.02_clock.12_8MHz.bootloader.bod_sample=0
tinyAVR012.menu.02_clock.12_8MHz.build.f_cpu=8000000L
tinyAVR012.menu.02_clock.12_8MHz=Internal 8 MHz
tinyAVR012.menu.02_clock.13_4MHz.bootloader.OSCCFG=0b00000001
tinyAVR012.menu.02_clock.13_4MHz.bootloader.bod_sample=0
tinyAVR012.menu.02_clock.13_4MHz.build.f_cpu=4000000L
tinyAVR012.menu.02_clock.13_4MHz=Internal 4 MHz
tinyAVR012.menu.02_clock.15_1MHz.bootloader.OSCCFG=0b00000001
tinyAVR012.menu.02_clock.15_1MHz.bootloader.bod_sample=0
tinyAVR012.menu.02_clock.15_1MHz.build.f_cpu=1000000L
tinyAVR012.menu.02_clock.15_1MHz=Internal 1 MHz
tinyAVR012.menu.02_clock.20=-
tinyAVR012.menu.02_clock.21_2MHz.bootloader.bod_sample=0
tinyAVR012.menu.02_clock.21_2MHz.build.f_cpu=2000000L
tinyAVR012.menu.02_clock.21_2MHz=Internal 2 MHz
tinyAVR012.menu.02_clock.22_32768Hz.bootloader.bod_sample=1
tinyAVR012.menu.02_clock.22_32768Hz.build.f_cpu=32768
tinyAVR012.menu.02_clock.22_32768Hz=Internal 32.768 kHz (ULP)
tinyAVR012.menu.11_BODMODE.01_disabled.bootloader.bod_mode=00
tinyAVR012.menu.11_BODMODE.01_disabled=BOD Disabled
tinyAVR012.menu.11_BODMODE.02_enabled.bootloader.bod_mode=01
tinyAVR012.menu.11_BODMODE.02_enabled=BOD Enabled
tinyAVR012.menu.11_BODMODE.03_sampled.bootloader.bod_mode=10
tinyAVR012.menu.11_BODMODE.03_sampled=BOD Sampled
tinyAVR012.menu.11_BODMODE.04_enablewait.bootloader.bod_mode=11
tinyAVR012.menu.11_BODMODE.04_enablewait=BOD Enabled hold wakeup
tinyAVR012.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
tinyAVR012.menu.12_BODLVL.BODLEVEL0=Level 1.8V (default)
tinyAVR012.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
tinyAVR012.menu.12_BODLVL.BODLEVEL2=Level 2.6V
tinyAVR012.menu.12_BODLVL.BODLEVEL7.bootloader.bod_lvl=111
tinyAVR012.menu.12_BODLVL.BODLEVEL7=Level 4.3V
tinyAVR012.menu.22_updipin.01_updi.bootloader.reset_bit=01
tinyAVR012.menu.22_updipin.01_updi=PA0 pin=UPDI (default)
tinyAVR012.menu.22_updipin.02_resetalt.bootloader.reset_bit=11
tinyAVR012.menu.22_updipin.02_resetalt=PA0 pin=UPDI and PB4 pin=RESET (tinyAVR-2 20/24pin only)
tinyAVR012.menu.22_updipin.10=-
tinyAVR012.menu.22_updipin.11_reset.bootloader.reset_bit=10
tinyAVR012.menu.22_updipin.11_reset=PA0 pin=Reset (DANGER:NOT RECOMMENDED)
tinyAVR012.menu.22_updipin.12_gpio.bootloader.reset_bit=00
tinyAVR012.menu.22_updipin.12_gpio=PA0 pin=GPIO (DANGER:NOT RECOMMENDED)
tinyAVR012.menu.23_eeprom.01_keep.bootloader.eesave_bit=1
tinyAVR012.menu.23_eeprom.01_keep=Save guard "Retained"
