askn37/multix-zinnia-updi4avr-firmware-builder/boards.txt
megaAVR0_noloader.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
megaAVR0_noloader.bootloader.BOOTSIZE=0x00
megaAVR0_noloader.bootloader.CODESIZE=0x00
megaAVR0_noloader.bootloader.OSCCFG=0b01111110
megaAVR0_noloader.bootloader.SYSCFG0=0b1111{bootloader.reset_bit}1{bootloader.eesave_bit}
megaAVR0_noloader.bootloader.SYSCFG1=0b11111111
megaAVR0_noloader.bootloader.WDTCFG=0b00000000
megaAVR0_noloader.bootloader.bod_lvl=000
megaAVR0_noloader.bootloader.bod_mode=00
megaAVR0_noloader.bootloader.bod_sample=0
megaAVR0_noloader.bootloader.eepupload=
megaAVR0_noloader.bootloader.eesave_bit=1
megaAVR0_noloader.bootloader.reset_bit=11
megaAVR0_noloader.bootloader.tool=avrdude
megaAVR0_noloader.bootloader.file=empty/empty.hex
megaAVR0_noloader.bootloader.programed_type=
megaAVR0_noloader.build.console_select=
megaAVR0_noloader.build.export_merged_output=false
megaAVR0_noloader.build.text_section_start=.text=0x0
megaAVR0_noloader.build.buildopt=-DNDEBUG
megaAVR0_noloader.build.console_baud=-DCONSOLE_BAUD=9600
megaAVR0_noloader.build.led_pin=
megaAVR0_noloader.build.macroapi=-DENABLE_MACRO_API
megaAVR0_noloader.build.printf=
megaAVR0_noloader.build.printflt=
megaAVR0_noloader.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p128.x
megaAVR0_noloader.upload.tool=
megaAVR0_noloader.menu.01_variant.01.build.board=AVR_ATMEGA4809
megaAVR0_noloader.menu.01_variant.01.build.mcu=atmega4809
megaAVR0_noloader.menu.01_variant.01.build.variant=megaAVR0_48
megaAVR0_noloader.menu.01_variant.01.upload.maximum_data_size=6144
megaAVR0_noloader.menu.01_variant.01.upload.maximum_size=49152
megaAVR0_noloader.menu.01_variant.01=48pin ATmega4809 (48KiB+6KiB)
megaAVR0_noloader.menu.01_variant.02.build.board=AVR_ATMEGA3209
megaAVR0_noloader.menu.01_variant.02.build.mcu=atmega3209
megaAVR0_noloader.menu.01_variant.02.build.variant=megaAVR0_48
megaAVR0_noloader.menu.01_variant.02.upload.maximum_data_size=4096
megaAVR0_noloader.menu.01_variant.02.upload.maximum_size=32768
megaAVR0_noloader.menu.01_variant.02=48pin ATmega3209 (32KiB+4KiB)
megaAVR0_noloader.menu.01_variant.03.build.board=AVR_ATMEGA1609
megaAVR0_noloader.menu.01_variant.03.build.mcu=atmega1609
megaAVR0_noloader.menu.01_variant.03.build.variant=megaAVR0_48
megaAVR0_noloader.menu.01_variant.03.upload.maximum_data_size=2048
megaAVR0_noloader.menu.01_variant.03.upload.maximum_size=16384
megaAVR0_noloader.menu.01_variant.03=48pin ATmega1609 (16KiB+2KiB)
megaAVR0_noloader.menu.01_variant.04.build.board=AVR_ATMEGA809
megaAVR0_noloader.menu.01_variant.04.build.mcu=atmega809
megaAVR0_noloader.menu.01_variant.04.build.variant=megaAVR0_48
megaAVR0_noloader.menu.01_variant.04.upload.maximum_data_size=1024
megaAVR0_noloader.menu.01_variant.04.upload.maximum_size=8192
megaAVR0_noloader.menu.01_variant.04=48pin ATmega809 (8KiB+1KiB)
megaAVR0_noloader.menu.01_variant.10=-
megaAVR0_noloader.menu.01_variant.11.build.board=AVR_ATMEGA4809
megaAVR0_noloader.menu.01_variant.11.build.mcu=atmega4809
megaAVR0_noloader.menu.01_variant.11.build.variant=megaAVR0_40
megaAVR0_noloader.menu.01_variant.11.upload.maximum_data_size=6144
megaAVR0_noloader.menu.01_variant.11.upload.maximum_size=49152
megaAVR0_noloader.menu.01_variant.11=40pin ATmega4809 (48KiB+6KiB)
megaAVR0_noloader.menu.01_variant.20=-
megaAVR0_noloader.menu.01_variant.21.build.board=AVR_ATMEGA4808
megaAVR0_noloader.menu.01_variant.21.build.mcu=atmega4808
megaAVR0_noloader.menu.01_variant.21.build.variant=megaAVR0_32
megaAVR0_noloader.menu.01_variant.21.upload.maximum_data_size=6144
megaAVR0_noloader.menu.01_variant.21.upload.maximum_size=49152
megaAVR0_noloader.menu.01_variant.21=32pin ATmega4808 (48KiB+6KiB)
megaAVR0_noloader.menu.01_variant.22.build.board=AVR_ATMEGA3208
megaAVR0_noloader.menu.01_variant.22.build.mcu=atmega3208
megaAVR0_noloader.menu.01_variant.22.build.variant=megaAVR0_32
megaAVR0_noloader.menu.01_variant.22.upload.maximum_data_size=4096
megaAVR0_noloader.menu.01_variant.22.upload.maximum_size=32768
megaAVR0_noloader.menu.01_variant.22=32pin ATmega3208 (32KiB+4KiB)
megaAVR0_noloader.menu.01_variant.23.build.board=AVR_ATMEGA1608
megaAVR0_noloader.menu.01_variant.23.build.mcu=atmega1608
megaAVR0_noloader.menu.01_variant.23.build.variant=megaAVR0_32
megaAVR0_noloader.menu.01_variant.23.upload.maximum_data_size=2048
megaAVR0_noloader.menu.01_variant.23.upload.maximum_size=16384
megaAVR0_noloader.menu.01_variant.23=32pin ATmega1608 (16KiB+2KiB)
megaAVR0_noloader.menu.01_variant.24.build.board=AVR_ATMEGA808
megaAVR0_noloader.menu.01_variant.24.build.mcu=atmega808
megaAVR0_noloader.menu.01_variant.24.build.variant=megaAVR0_32
megaAVR0_noloader.menu.01_variant.24.upload.maximum_data_size=1024
megaAVR0_noloader.menu.01_variant.24.upload.maximum_size=8192
megaAVR0_noloader.menu.01_variant.24=32pin ATmega808 (8KiB+1KiB)
megaAVR0_noloader.menu.01_variant.30=-
megaAVR0_noloader.menu.01_variant.31.build.board=AVR_ATMEGA4808
megaAVR0_noloader.menu.01_variant.31.build.mcu=atmega4808
megaAVR0_noloader.menu.01_variant.31.build.variant=megaAVR0_28
megaAVR0_noloader.menu.01_variant.31.upload.maximum_data_size=6144
megaAVR0_noloader.menu.01_variant.31.upload.maximum_size=49152
megaAVR0_noloader.menu.01_variant.31=28pin ATmega4808 (48KiB+6KiB)
megaAVR0_noloader.menu.01_variant.32.build.board=AVR_ATMEGA3208
megaAVR0_noloader.menu.01_variant.32.build.mcu=atmega3208
megaAVR0_noloader.menu.01_variant.32.build.variant=megaAVR0_28
megaAVR0_noloader.menu.01_variant.32.upload.maximum_data_size=4096
megaAVR0_noloader.menu.01_variant.32.upload.maximum_size=32768
megaAVR0_noloader.menu.01_variant.32=28pin ATmega3208 (32KiB+4KiB)
megaAVR0_noloader.menu.01_variant.33.build.board=AVR_ATMEGA1608
megaAVR0_noloader.menu.01_variant.33.build.mcu=atmega1608
megaAVR0_noloader.menu.01_variant.33.build.variant=megaAVR0_28
megaAVR0_noloader.menu.01_variant.33.upload.maximum_data_size=2048
megaAVR0_noloader.menu.01_variant.33.upload.maximum_size=16384
megaAVR0_noloader.menu.01_variant.33=28pin ATmega1608 (16KiB+2KiB)
megaAVR0_noloader.menu.01_variant.34.build.board=AVR_ATMEGA808
megaAVR0_noloader.menu.01_variant.34.build.mcu=atmega808
megaAVR0_noloader.menu.01_variant.34.build.variant=megaAVR0_28
megaAVR0_noloader.menu.01_variant.34.upload.maximum_data_size=1024
megaAVR0_noloader.menu.01_variant.34.upload.maximum_size=8192
megaAVR0_noloader.menu.01_variant.34=28pin ATmega808 (8KiB+1KiB)
megaAVR0_noloader.menu.02_clock.01_20MHz.bootloader.bod_sample=0
megaAVR0_noloader.menu.02_clock.01_20MHz.build.f_cpu=20000000L
megaAVR0_noloader.menu.02_clock.01_20MHz=Internal 20 MHz
megaAVR0_noloader.menu.02_clock.02_10MHz.bootloader.bod_sample=0
megaAVR0_noloader.menu.02_clock.02_10MHz.build.f_cpu=10000000L
megaAVR0_noloader.menu.02_clock.02_10MHz=Internal 10 MHz
megaAVR0_noloader.menu.02_clock.03_5MHz.bootloader.bod_sample=0
megaAVR0_noloader.menu.02_clock.03_5MHz.build.f_cpu=5000000L
megaAVR0_noloader.menu.02_clock.03_5MHz=Internal 5 MHz
megaAVR0_noloader.menu.02_clock.10=-
megaAVR0_noloader.menu.02_clock.11_16MHz.bootloader.OSCCFG=0b00000001
megaAVR0_noloader.menu.02_clock.11_16MHz.bootloader.bod_sample=0
megaAVR0_noloader.menu.02_clock.11_16MHz.build.f_cpu=16000000L
megaAVR0_noloader.menu.02_clock.11_16MHz=Internal 16 MHz
megaAVR0_noloader.menu.02_clock.12_8MHz.bootloader.OSCCFG=0b00000001
megaAVR0_noloader.menu.02_clock.12_8MHz.bootloader.bod_sample=0
megaAVR0_noloader.menu.02_clock.12_8MHz.build.f_cpu=8000000L
megaAVR0_noloader.menu.02_clock.12_8MHz=Internal 8 MHz
megaAVR0_noloader.menu.02_clock.13_4MHz.bootloader.OSCCFG=0b00000001
megaAVR0_noloader.menu.02_clock.13_4MHz.bootloader.bod_sample=0
megaAVR0_noloader.menu.02_clock.13_4MHz.build.f_cpu=4000000L
megaAVR0_noloader.menu.02_clock.13_4MHz=Internal 4 MHz
megaAVR0_noloader.menu.02_clock.15_1MHz.bootloader.OSCCFG=0b00000001
megaAVR0_noloader.menu.02_clock.15_1MHz.bootloader.bod_sample=0
megaAVR0_noloader.menu.02_clock.15_1MHz.build.f_cpu=1000000L
megaAVR0_noloader.menu.02_clock.15_1MHz=Internal 1 MHz
megaAVR0_noloader.menu.02_clock.20=-
megaAVR0_noloader.menu.02_clock.21_2MHz.bootloader.bod_sample=0
megaAVR0_noloader.menu.02_clock.21_2MHz.build.f_cpu=2000000L
megaAVR0_noloader.menu.02_clock.21_2MHz=Internal 2 MHz
megaAVR0_noloader.menu.02_clock.22_32768Hz.bootloader.bod_sample=1
megaAVR0_noloader.menu.02_clock.22_32768Hz.build.f_cpu=32768
megaAVR0_noloader.menu.02_clock.22_32768Hz=Internal 32.768 kHz (ULP)
megaAVR0_noloader.menu.11_BODMODE.01_disabled.bootloader.bod_mode=00
megaAVR0_noloader.menu.11_BODMODE.01_disabled=BOD Disabled
megaAVR0_noloader.menu.11_BODMODE.02_enabled.bootloader.bod_mode=01
megaAVR0_noloader.menu.11_BODMODE.02_enabled=BOD Enabled
megaAVR0_noloader.menu.11_BODMODE.03_sampled.bootloader.bod_mode=10
megaAVR0_noloader.menu.11_BODMODE.03_sampled=BOD Sampled
megaAVR0_noloader.menu.11_BODMODE.04_enablewait.bootloader.bod_mode=11
megaAVR0_noloader.menu.11_BODMODE.04_enablewait=BOD Enabled hold wakeup
megaAVR0_noloader.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
megaAVR0_noloader.menu.12_BODLVL.BODLEVEL0=Level 1.8V (default)
megaAVR0_noloader.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
megaAVR0_noloader.menu.12_BODLVL.BODLEVEL2=Level 2.6V
megaAVR0_noloader.menu.12_BODLVL.BODLEVEL7.bootloader.bod_lvl=111
megaAVR0_noloader.menu.12_BODLVL.BODLEVEL7=Level 4.3V
megaAVR0_noloader.menu.21_resetpin.01_reset.bootloader.reset_bit=11
megaAVR0_noloader.menu.21_resetpin.01_reset=PF6 pin=Reset
megaAVR0_noloader.menu.21_resetpin.02_gpio.bootloader.reset_bit=01
megaAVR0_noloader.menu.21_resetpin.02_gpio=PF6 pin=GPIO (input only)
megaAVR0_noloader.menu.23_eeprom.01_keep.bootloader.eesave_bit=1
megaAVR0_noloader.menu.23_eeprom.01_keep=Save guard "Retained"
megaAVR0_noloader.menu.23_eeprom.02_erase.bootloader.eesave_bit=0
megaAVR0_noloader.menu.23_eeprom.02_erase=Save guard "Erase"
megaAVR0_noloader.menu.23_eeprom.03_replace.bootloader.eepupload={bootloader.eeprom}
megaAVR0_noloader.menu.23_eeprom.03_replace.bootloader.eesave_bit=1
megaAVR0_noloader.menu.23_eeprom.03_replace="Erase" and "Replace"
megaAVR0_noloader.menu.51_buildopt.01_Release=Build Release (default)
megaAVR0_noloader.menu.51_buildopt.02_Debug1.build.buildopt=-DDEBUG=1
megaAVR0_noloader.menu.51_buildopt.02_Debug1=Build DEBUG=1
megaAVR0_noloader.menu.51_buildopt.03_Debug2.build.buildopt=-DDEBUG=2
megaAVR0_noloader.menu.51_buildopt.03_Debug2=Build DEBUG=2
megaAVR0_noloader.menu.52_macroapi.01_Enable=Macro API Enable (default)
megaAVR0_noloader.menu.52_macroapi.02_Disable.build.macroapi=
megaAVR0_noloader.menu.52_macroapi.02_Disable=Macro API Disable
megaAVR0_noloader.menu.52_macroapi.03_AllDisable.build.macroapi=
megaAVR0_noloader.menu.52_macroapi.03_AllDisable.compiler.ldflags=-nostartfiles -nostdlib
megaAVR0_noloader.menu.52_macroapi.03_AllDisable=Standard Library All Disable
megaAVR0_noloader.menu.53_printf.01_default=default
megaAVR0_noloader.menu.53_printf.02_full.build.printf=-DUSE_PRINTF_FLT
megaAVR0_noloader.menu.53_printf.02_full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
megaAVR0_noloader.menu.53_printf.02_full=Float Support
megaAVR0_noloader.menu.54_console_select.01_UART0_A0_LA7.build.console_select=-DSerial=Serial0A
megaAVR0_noloader.menu.54_console_select.01_UART0_A0_LA7.build.led_pin=-DLED_BUILTIN=PIN_PA7
megaAVR0_noloader.menu.54_console_select.01_UART0_A0_LA7=UART0 TX:PA0 RX:PA1 LED=PA7
megaAVR0_noloader.menu.54_console_select.02_UART1_C0_LA7.build.console_select=-DSerial=Serial1A
megaAVR0_noloader.menu.54_console_select.02_UART1_C0_LA7.build.led_pin=-DLED_BUILTIN=PIN_PA7
megaAVR0_noloader.menu.54_console_select.02_UART1_C0_LA7=UART1 TX:PC0 RX:PC1 LED=PA7
megaAVR0_noloader.menu.54_console_select.03_UART2_F0_LA7.build.console_select=-DSerial=Serial2A
megaAVR0_noloader.menu.54_console_select.03_UART2_F0_LA7.build.led_pin=-DLED_BUILTIN=PIN_PA7
megaAVR0_noloader.menu.54_console_select.03_UART2_F0_LA7=UART2 TX:PF0 RX:PF1 LED=PA7
megaAVR0_noloader.menu.54_console_select.10=-
megaAVR0_noloader.menu.54_console_select.11_UART2_F4_LA7.build.console_select=-DSerial=Serial2B
megaAVR0_noloader.menu.54_console_select.11_UART2_F4_LA7.build.led_pin=-DLED_BUILTIN=PIN_PA7
megaAVR0_noloader.menu.54_console_select.11_UART2_F4_LA7=UART2 TX:PF4 RX:PF5 LED=PA7 (32/48pin)
megaAVR0_noloader.menu.54_console_select.20=-
megaAVR0_noloader.menu.54_console_select.21_UART3_B4_LD6.build.console_select=-DSerial=Serial3B
megaAVR0_noloader.menu.54_console_select.21_UART3_B4_LD6.build.led_pin=-DLED_BUILTIN=PIN_PD6
megaAVR0_noloader.menu.54_console_select.21_UART3_B4_LD6=UART3 TX:PB4 RX:PB5 LED=PD6 (ATmega4809 UNO WiFi)
megaAVR0_noloader.menu.54_console_select.22_UART3_B4_LE2_NanoEvery.build.console_select=-DSerial=Serial3B
megaAVR0_noloader.menu.54_console_select.22_UART3_B4_LE2_NanoEvery.build.led_pin=-DLED_BUILTIN=PIN_PE2
megaAVR0_noloader.menu.54_console_select.22_UART3_B4_LE2_NanoEvery.upload.tool=avrdude_nanoevery
megaAVR0_noloader.menu.54_console_select.22_UART3_B4_LE2_NanoEvery.upload.protocol=jtag2updi
megaAVR0_noloader.menu.54_console_select.22_UART3_B4_LE2_NanoEvery.upload.speed=115200
megaAVR0_noloader.menu.54_console_select.22_UART3_B4_LE2_NanoEvery.upload.use_1200bps_touch=true
megaAVR0_noloader.menu.54_console_select.22_UART3_B4_LE2_NanoEvery=UART3 TX:PB4 RX:PB5 LED=PE2 (ATmega4809 Nano Every)
megaAVR0_noloader.menu.54_console_select.23_UART1_C9_LC7_SB2_XplainedPro.build.console_select=-DSerial=Serial1A
megaAVR0_noloader.menu.54_console_select.23_UART1_C9_LC7_SB2_XplainedPro.build.led_pin=-DLED_BUILTIN=PIN_PC7 -DSW_BUILTIN=PIN_PB2
megaAVR0_noloader.menu.54_console_select.23_UART1_C9_LC7_SB2_XplainedPro=UART1 TX:PC0 RX:PC1 LED=PC7 SW=PB2 (ATmega4809 Xplained PRO)
megaAVR0_noloader.menu.54_console_select.24_UART3_B0_LF5_SF6_Curiosity.build.console_select=-DSerial=Serial3A
megaAVR0_noloader.menu.54_console_select.24_UART3_B0_LF5_SF6_Curiosity.build.led_pin=-DLED_BUILTIN=PIN_PF5 -DSW_BUILTIN=PIN_PF6
megaAVR0_noloader.menu.54_console_select.24_UART3_B0_LF5_SF6_Curiosity=UART3 TX:PB0 RX:PB1 LED=PF5 SW=PF6 (ATmega4809 Curiosity Nano)
megaAVR0_noloader.menu.90_console_baud.01_9600bps.build.console_baud=-DCONSOLE_BAUD=9600
megaAVR0_noloader.menu.90_console_baud.01_9600bps=CONSOLE_BAUD=9600 bps (default)
megaAVR0_noloader.menu.90_console_baud.03_38400bps.build.console_baud=-DCONSOLE_BAUD=38400
megaAVR0_noloader.menu.90_console_baud.03_38400bps=CONSOLE_BAUD=38400 bps
megaAVR0_noloader.menu.90_console_baud.04_57600bps.build.console_baud=-DCONSOLE_BAUD=57600
megaAVR0_noloader.menu.90_console_baud.04_57600bps=CONSOLE_BAUD=57600 bps
megaAVR0_noloader.menu.90_console_baud.05_115200bps.build.console_baud=-DCONSOLE_BAUD=115200
megaAVR0_noloader.menu.90_console_baud.05_115200bps=CONSOLE_BAUD=115200 bps
megaAVR0_noloader.menu.90_console_baud.06_230400bps.build.console_baud=-DCONSOLE_BAUD=230400
megaAVR0_noloader.menu.90_console_baud.06_230400bps=CONSOLE_BAUD=230400 bps
megaAVR0_noloader.menu.90_console_baud.15_1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
megaAVR0_noloader.menu.90_console_baud.15_1000000bps=CONSOLE_BAUD=1000000 bps
megaAVR0_noloader.menu.90_console_baud.20=-
megaAVR0_noloader.menu.90_console_baud.21_2400bps.build.console_baud=-DCONSOLE_BAUD=2400
megaAVR0_noloader.menu.90_console_baud.21_2400bps=CONSOLE_BAUD=2400 bps (for ULP)
megaAVR0_noloader.menu.95_bootloader.01_woBootloader=without Bootloader


