askn37/multix-zinnia-updi4avr-firmware-builder/boards.txt
tinyAVR012_noloader.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
tinyAVR012_noloader.bootloader.BOOTSIZE=0x00
tinyAVR012_noloader.bootloader.CODESIZE=0x00
tinyAVR012_noloader.bootloader.OSCCFG=0b01111110
tinyAVR012_noloader.bootloader.SYSCFG0=0b1111{bootloader.reset_bit}1{bootloader.eesave_bit}
tinyAVR012_noloader.bootloader.SYSCFG1=0b11111111
tinyAVR012_noloader.bootloader.WDTCFG=0b00000000
tinyAVR012_noloader.bootloader.bod_lvl=000
tinyAVR012_noloader.bootloader.bod_mode=00
tinyAVR012_noloader.bootloader.bod_sample=0
tinyAVR012_noloader.bootloader.eepupload=
tinyAVR012_noloader.bootloader.eesave_bit=1
tinyAVR012_noloader.bootloader.reset_bit=10
tinyAVR012_noloader.bootloader.tool=avrdude
tinyAVR012_noloader.bootloader.file=empty/empty.hex
tinyAVR012_noloader.bootloader.programed_type=
tinyAVR012_noloader.build.console_select=
tinyAVR012_noloader.build.export_merged_output=false
tinyAVR012_noloader.build.text_section_start=.text=0x0
tinyAVR012_noloader.build.buildopt=-DNDEBUG
tinyAVR012_noloader.build.console_baud=-DCONSOLE_BAUD=9600
tinyAVR012_noloader.build.led_pin=-DLED_BUILTIN=PIN_PA7
tinyAVR012_noloader.build.macroapi=-DENABLE_MACRO_API
tinyAVR012_noloader.build.printf=
tinyAVR012_noloader.build.printflt=
tinyAVR012_noloader.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p64.x
tinyAVR012_noloader.upload.tool=
tinyAVR012_noloader.menu.01_variant.01.build.board=AVR_ATTINY3227
tinyAVR012_noloader.menu.01_variant.01.build.mcu=attiny3227
tinyAVR012_noloader.menu.01_variant.01.build.variant=tinyAVR2_24
tinyAVR012_noloader.menu.01_variant.01.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p128.x
tinyAVR012_noloader.menu.01_variant.01.upload.maximum_data_size=3072
tinyAVR012_noloader.menu.01_variant.01.upload.maximum_size=32768
tinyAVR012_noloader.menu.01_variant.01=tinyAVR-2 24pin ATtiny3227 (32KiB+3KiB)
tinyAVR012_noloader.menu.01_variant.02.build.board=AVR_ATTINY1627
tinyAVR012_noloader.menu.01_variant.02.build.mcu=attiny1627
tinyAVR012_noloader.menu.01_variant.02.build.variant=tinyAVR2_24
tinyAVR012_noloader.menu.01_variant.02.upload.maximum_data_size=2048
tinyAVR012_noloader.menu.01_variant.02.upload.maximum_size=16384
tinyAVR012_noloader.menu.01_variant.02=tinyAVR-2 24pin ATtiny1627 (16KiB+2KiB)
tinyAVR012_noloader.menu.01_variant.03.build.board=AVR_ATTINY827
tinyAVR012_noloader.menu.01_variant.03.build.mcu=attiny827
tinyAVR012_noloader.menu.01_variant.03.build.variant=tinyAVR2_24
tinyAVR012_noloader.menu.01_variant.03.upload.maximum_data_size=1024
tinyAVR012_noloader.menu.01_variant.03.upload.maximum_size=8192
tinyAVR012_noloader.menu.01_variant.03=tinyAVR-2 24pin ATtiny827 (8KiB+1KiB)
tinyAVR012_noloader.menu.01_variant.04.build.board=AVR_ATTINY427
tinyAVR012_noloader.menu.01_variant.04.build.mcu=attiny427
tinyAVR012_noloader.menu.01_variant.04.build.variant=tinyAVR2_24
tinyAVR012_noloader.menu.01_variant.04.upload.maximum_data_size=512
tinyAVR012_noloader.menu.01_variant.04.upload.maximum_size=4096
tinyAVR012_noloader.menu.01_variant.04=tinyAVR-2 24pin ATtiny427 (4KiB+512B)
tinyAVR012_noloader.menu.01_variant.10=-
tinyAVR012_noloader.menu.01_variant.11.build.board=AVR_ATTINY3226
tinyAVR012_noloader.menu.01_variant.11.build.mcu=attiny3226
tinyAVR012_noloader.menu.01_variant.11.build.variant=tinyAVR2_20
tinyAVR012_noloader.menu.01_variant.11.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p128.x
tinyAVR012_noloader.menu.01_variant.11.upload.maximum_data_size=3072
tinyAVR012_noloader.menu.01_variant.11.upload.maximum_size=32768
tinyAVR012_noloader.menu.01_variant.11=tinyAVR-2 20pin ATtiny3226 (32KiB+3KiB)
tinyAVR012_noloader.menu.01_variant.12.build.board=AVR_ATTINY1626
tinyAVR012_noloader.menu.01_variant.12.build.mcu=attiny1626
tinyAVR012_noloader.menu.01_variant.12.build.variant=tinyAVR2_20
tinyAVR012_noloader.menu.01_variant.12.upload.maximum_data_size=2048
tinyAVR012_noloader.menu.01_variant.12.upload.maximum_size=16384
tinyAVR012_noloader.menu.01_variant.12=tinyAVR-2 20pin ATtiny1626 (16KiB+2KiB)
tinyAVR012_noloader.menu.01_variant.13.build.board=AVR_ATTINY826
tinyAVR012_noloader.menu.01_variant.13.build.mcu=attiny826
tinyAVR012_noloader.menu.01_variant.13.build.variant=tinyAVR2_20
tinyAVR012_noloader.menu.01_variant.13.upload.maximum_data_size=1024
tinyAVR012_noloader.menu.01_variant.13.upload.maximum_size=8192
tinyAVR012_noloader.menu.01_variant.13=tinyAVR-2 20pin ATtiny826 (8KiB+1KiB)
tinyAVR012_noloader.menu.01_variant.14.build.board=AVR_ATTINY426
tinyAVR012_noloader.menu.01_variant.14.build.mcu=attiny426
tinyAVR012_noloader.menu.01_variant.14.build.variant=tinyAVR2_20
tinyAVR012_noloader.menu.01_variant.14.upload.maximum_data_size=512
tinyAVR012_noloader.menu.01_variant.14.upload.maximum_size=4096
tinyAVR012_noloader.menu.01_variant.14=tinyAVR-2 20pin ATtiny426 (4KiB+512B)
tinyAVR012_noloader.menu.01_variant.20=-
tinyAVR012_noloader.menu.01_variant.21.build.board=AVR_ATTINY3224
tinyAVR012_noloader.menu.01_variant.21.build.mcu=attiny3224
tinyAVR012_noloader.menu.01_variant.21.build.variant=tinyAVR2_14
tinyAVR012_noloader.menu.01_variant.21.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p128.x
tinyAVR012_noloader.menu.01_variant.21.upload.maximum_data_size=3072
tinyAVR012_noloader.menu.01_variant.21.upload.maximum_size=32768
tinyAVR012_noloader.menu.01_variant.21=tinyAVR-2 14pin ATtiny3224 (32KiB+3KiB)
tinyAVR012_noloader.menu.01_variant.22.build.board=AVR_ATTINY1624
tinyAVR012_noloader.menu.01_variant.22.build.mcu=attiny1624
tinyAVR012_noloader.menu.01_variant.22.build.variant=tinyAVR2_14
tinyAVR012_noloader.menu.01_variant.22.upload.maximum_data_size=2048
tinyAVR012_noloader.menu.01_variant.22.upload.maximum_size=16384
tinyAVR012_noloader.menu.01_variant.22=tinyAVR-2 14pin ATtiny1624 (16KiB+2KiB)
tinyAVR012_noloader.menu.01_variant.23.build.board=AVR_ATTINY824
tinyAVR012_noloader.menu.01_variant.23.build.mcu=attiny824
tinyAVR012_noloader.menu.01_variant.23.build.variant=tinyAVR2_14
tinyAVR012_noloader.menu.01_variant.23.upload.maximum_data_size=1024
tinyAVR012_noloader.menu.01_variant.23.upload.maximum_size=8192
tinyAVR012_noloader.menu.01_variant.23=tinyAVR-2 14pin ATtiny824 (8KiB+1KiB)
tinyAVR012_noloader.menu.01_variant.24.build.board=AVR_ATTINY424
tinyAVR012_noloader.menu.01_variant.24.build.mcu=attiny424
tinyAVR012_noloader.menu.01_variant.24.build.variant=tinyAVR2_14
tinyAVR012_noloader.menu.01_variant.24.upload.maximum_data_size=512
tinyAVR012_noloader.menu.01_variant.24.upload.maximum_size=4096
tinyAVR012_noloader.menu.01_variant.24=tinyAVR-2 14pin ATtiny424 (4KiB+512B)
tinyAVR012_noloader.menu.01_variant.30=-
tinyAVR012_noloader.menu.01_variant.31.build.board=AVR_ATTINY3217
tinyAVR012_noloader.menu.01_variant.31.build.mcu=attiny3217
tinyAVR012_noloader.menu.01_variant.31.build.variant=tinyAVR1_24
tinyAVR012_noloader.menu.01_variant.31.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p128.x
tinyAVR012_noloader.menu.01_variant.31.upload.maximum_data_size=2048
tinyAVR012_noloader.menu.01_variant.31.upload.maximum_size=32768
tinyAVR012_noloader.menu.01_variant.31=tinyAVR-1 24pin ATtiny3217 (32KiB+2KiB)
tinyAVR012_noloader.menu.01_variant.32.build.board=AVR_ATTINY1617
tinyAVR012_noloader.menu.01_variant.32.build.mcu=attiny1617
tinyAVR012_noloader.menu.01_variant.32.build.variant=tinyAVR1_24
tinyAVR012_noloader.menu.01_variant.32.upload.maximum_data_size=2048
tinyAVR012_noloader.menu.01_variant.32.upload.maximum_size=16384
tinyAVR012_noloader.menu.01_variant.32=tinyAVR-1 24pin ATtiny1617 (16KiB+2KiB)
tinyAVR012_noloader.menu.01_variant.33.build.board=AVR_ATTINY817
tinyAVR012_noloader.menu.01_variant.33.build.mcu=attiny817
tinyAVR012_noloader.menu.01_variant.33.build.variant=tinyAVR1_24
tinyAVR012_noloader.menu.01_variant.33.upload.maximum_data_size=512
tinyAVR012_noloader.menu.01_variant.33.upload.maximum_size=8192
tinyAVR012_noloader.menu.01_variant.33=tinyAVR-1 24pin ATtiny817 (8KiB+512B)
tinyAVR012_noloader.menu.01_variant.34.build.board=AVR_ATTINY417
tinyAVR012_noloader.menu.01_variant.34.build.mcu=attiny417
tinyAVR012_noloader.menu.01_variant.34.build.variant=tinyAVR1_24
tinyAVR012_noloader.menu.01_variant.34.upload.maximum_data_size=256
tinyAVR012_noloader.menu.01_variant.34.upload.maximum_size=4096
tinyAVR012_noloader.menu.01_variant.34=tinyAVR-1 24pin ATtiny417 (4KiB+256B)
tinyAVR012_noloader.menu.01_variant.40=-
tinyAVR012_noloader.menu.01_variant.41.build.board=AVR_ATTINY3216
tinyAVR012_noloader.menu.01_variant.41.build.mcu=attiny3216
tinyAVR012_noloader.menu.01_variant.41.build.variant=tinyAVR1_20
tinyAVR012_noloader.menu.01_variant.41.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p128.x
tinyAVR012_noloader.menu.01_variant.41.upload.maximum_data_size=2048
tinyAVR012_noloader.menu.01_variant.41.upload.maximum_size=32768
tinyAVR012_noloader.menu.01_variant.41=tinyAVR-1 20pin ATtiny3216 (32KiB+2KiB)
tinyAVR012_noloader.menu.01_variant.42.build.board=AVR_ATTINY1616
tinyAVR012_noloader.menu.01_variant.42.build.mcu=attiny1616
tinyAVR012_noloader.menu.01_variant.42.build.variant=tinyAVR1_20
tinyAVR012_noloader.menu.01_variant.42.upload.maximum_data_size=2048
tinyAVR012_noloader.menu.01_variant.42.upload.maximum_size=16384
tinyAVR012_noloader.menu.01_variant.42=tinyAVR-1 20pin ATtiny1616 (16KiB+2KiB)
tinyAVR012_noloader.menu.01_variant.43.build.board=AVR_ATTINY816
tinyAVR012_noloader.menu.01_variant.43.build.mcu=attiny816
tinyAVR012_noloader.menu.01_variant.43.build.variant=tinyAVR1_20
tinyAVR012_noloader.menu.01_variant.43.upload.maximum_data_size=512
tinyAVR012_noloader.menu.01_variant.43.upload.maximum_size=8192
tinyAVR012_noloader.menu.01_variant.43=tinyAVR-1 20pin ATtiny816 (8KiB+512B)
tinyAVR012_noloader.menu.01_variant.44.build.board=AVR_ATTINY416
tinyAVR012_noloader.menu.01_variant.44.build.mcu=attiny416
tinyAVR012_noloader.menu.01_variant.44.build.variant=tinyAVR1_20
tinyAVR012_noloader.menu.01_variant.44.upload.maximum_data_size=256
tinyAVR012_noloader.menu.01_variant.44.upload.maximum_size=4096
tinyAVR012_noloader.menu.01_variant.44=tinyAVR-1 20pin ATtiny416 (4KiB+256B)
tinyAVR012_noloader.menu.01_variant.50=-
tinyAVR012_noloader.menu.01_variant.51.build.board=AVR_ATTINY1614
tinyAVR012_noloader.menu.01_variant.51.build.mcu=attiny1614
tinyAVR012_noloader.menu.01_variant.51.build.variant=tinyAVR1_14
tinyAVR012_noloader.menu.01_variant.51.upload.maximum_data_size=2048
tinyAVR012_noloader.menu.01_variant.51.upload.maximum_size=16384
tinyAVR012_noloader.menu.01_variant.51=tinyAVR-1 14pin ATtiny1614 (16KiB+2KiB)
tinyAVR012_noloader.menu.01_variant.52.build.board=AVR_ATTINY814
tinyAVR012_noloader.menu.01_variant.52.build.mcu=attiny814
tinyAVR012_noloader.menu.01_variant.52.build.variant=tinyAVR1_14
tinyAVR012_noloader.menu.01_variant.52.upload.maximum_data_size=512
tinyAVR012_noloader.menu.01_variant.52.upload.maximum_size=8192
tinyAVR012_noloader.menu.01_variant.52=tinyAVR-1 14pin ATtiny814 (8KiB+512B)
tinyAVR012_noloader.menu.01_variant.53.build.board=AVR_ATTINY414
tinyAVR012_noloader.menu.01_variant.53.build.mcu=attiny414
tinyAVR012_noloader.menu.01_variant.53.build.variant=tinyAVR1_14
tinyAVR012_noloader.menu.01_variant.53.upload.maximum_data_size=256
tinyAVR012_noloader.menu.01_variant.53.upload.maximum_size=4096
tinyAVR012_noloader.menu.01_variant.53=tinyAVR-1 14pin ATtiny414 (4KiB+256B)
tinyAVR012_noloader.menu.01_variant.60=-
tinyAVR012_noloader.menu.01_variant.61.build.board=AVR_ATTINY412
tinyAVR012_noloader.menu.01_variant.61.build.led_pin=-DLED_BUILTIN=PIN_PA3
tinyAVR012_noloader.menu.01_variant.61.build.mcu=attiny412
tinyAVR012_noloader.menu.01_variant.61.build.variant=tinyAVR1_8
tinyAVR012_noloader.menu.01_variant.61.upload.maximum_data_size=256
tinyAVR012_noloader.menu.01_variant.61.upload.maximum_size=4096
tinyAVR012_noloader.menu.01_variant.61=tinyAVR-1 8pin ATtiny412 (4KiB+256B)
tinyAVR012_noloader.menu.01_variant.62.build.board=AVR_ATTINY212
tinyAVR012_noloader.menu.01_variant.61.build.led_pin=-DLED_BUILTIN=PIN_PA3
tinyAVR012_noloader.menu.01_variant.62.build.mcu=attiny212
tinyAVR012_noloader.menu.01_variant.62.build.variant=tinyAVR1_8
tinyAVR012_noloader.menu.01_variant.62.upload.maximum_data_size=128
tinyAVR012_noloader.menu.01_variant.62.upload.maximum_size=2048
tinyAVR012_noloader.menu.01_variant.62=tinyAVR-1 8pin ATtiny212 (2KiB+128B)
tinyAVR012_noloader.menu.01_variant.70=-
tinyAVR012_noloader.menu.01_variant.71.build.board=AVR_ATTINY1607
tinyAVR012_noloader.menu.01_variant.71.build.mcu=attiny1607
tinyAVR012_noloader.menu.01_variant.71.build.variant=tinyAVR0_24
tinyAVR012_noloader.menu.01_variant.71.upload.maximum_data_size=1024
tinyAVR012_noloader.menu.01_variant.71.upload.maximum_size=16384
tinyAVR012_noloader.menu.01_variant.71=tinyAVR-0 24pin ATtiny1607 (16KiB+1KiB)
tinyAVR012_noloader.menu.01_variant.72.build.board=AVR_ATTINY807
tinyAVR012_noloader.menu.01_variant.72.build.mcu=attiny807
tinyAVR012_noloader.menu.01_variant.72.build.variant=tinyAVR0_24
tinyAVR012_noloader.menu.01_variant.72.upload.maximum_data_size=512
tinyAVR012_noloader.menu.01_variant.72.upload.maximum_size=8192
tinyAVR012_noloader.menu.01_variant.72=tinyAVR-0 24pin ATtiny807 (8KiB+512B)
tinyAVR012_noloader.menu.01_variant.80=-
tinyAVR012_noloader.menu.01_variant.81.build.board=AVR_ATTINY1606
tinyAVR012_noloader.menu.01_variant.81.build.mcu=attiny1606
tinyAVR012_noloader.menu.01_variant.81.build.variant=tinyAVR0_20
tinyAVR012_noloader.menu.01_variant.81.upload.maximum_data_size=1024
tinyAVR012_noloader.menu.01_variant.81.upload.maximum_size=16384
tinyAVR012_noloader.menu.01_variant.81=tinyAVR-0 20pin ATtiny1606 (16KiB+1KiB)
tinyAVR012_noloader.menu.01_variant.82.build.board=AVR_ATTINY806
tinyAVR012_noloader.menu.01_variant.82.build.mcu=attiny806
tinyAVR012_noloader.menu.01_variant.82.build.variant=tinyAVR0_20
tinyAVR012_noloader.menu.01_variant.82.upload.maximum_data_size=512
tinyAVR012_noloader.menu.01_variant.82.upload.maximum_size=8192
tinyAVR012_noloader.menu.01_variant.82=tinyAVR-0 20pin ATtiny806 (8KiB+512B)
tinyAVR012_noloader.menu.01_variant.83.build.board=AVR_ATTINY406
tinyAVR012_noloader.menu.01_variant.83.build.mcu=attiny406
tinyAVR012_noloader.menu.01_variant.83.build.variant=tinyAVR0_20
tinyAVR012_noloader.menu.01_variant.83.upload.maximum_data_size=256
tinyAVR012_noloader.menu.01_variant.83.upload.maximum_size=4096
tinyAVR012_noloader.menu.01_variant.83=tinyAVR-0 20pin ATtiny406 (4KiB+256B)
tinyAVR012_noloader.menu.01_variant.90=-
tinyAVR012_noloader.menu.01_variant.91.build.board=AVR_ATTINY1604
tinyAVR012_noloader.menu.01_variant.91.build.mcu=attiny1604
tinyAVR012_noloader.menu.01_variant.91.build.variant=tinyAVR0_14
tinyAVR012_noloader.menu.01_variant.91.upload.maximum_data_size=1024
tinyAVR012_noloader.menu.01_variant.91.upload.maximum_size=16384
tinyAVR012_noloader.menu.01_variant.91=tinyAVR-0 14pin ATtiny1604 (16KiB+1KiB)
tinyAVR012_noloader.menu.01_variant.92.build.board=AVR_ATTINY804
tinyAVR012_noloader.menu.01_variant.92.build.mcu=attiny804
tinyAVR012_noloader.menu.01_variant.92.build.variant=tinyAVR0_14
tinyAVR012_noloader.menu.01_variant.92.upload.maximum_data_size=512
tinyAVR012_noloader.menu.01_variant.92.upload.maximum_size=8192
tinyAVR012_noloader.menu.01_variant.92=tinyAVR-0 14pin ATtiny804 (8KiB+512B)
tinyAVR012_noloader.menu.01_variant.93.build.board=AVR_ATTINY404
tinyAVR012_noloader.menu.01_variant.93.build.mcu=attiny404
tinyAVR012_noloader.menu.01_variant.93.build.variant=tinyAVR0_14
tinyAVR012_noloader.menu.01_variant.93.upload.maximum_data_size=256
tinyAVR012_noloader.menu.01_variant.93.upload.maximum_size=4096
tinyAVR012_noloader.menu.01_variant.93=tinyAVR-0 14pin ATtiny404 (4KiB+256B)
tinyAVR012_noloader.menu.01_variant.A0=-
tinyAVR012_noloader.menu.01_variant.A1.build.board=AVR_ATTINY402
tinyAVR012_noloader.menu.01_variant.A1.build.led_pin=-DLED_BUILTIN=PIN_PA3
tinyAVR012_noloader.menu.01_variant.A1.build.mcu=attiny402
tinyAVR012_noloader.menu.01_variant.A1.build.variant=tinyAVR0_8
tinyAVR012_noloader.menu.01_variant.A1.upload.maximum_data_size=256
tinyAVR012_noloader.menu.01_variant.A1.upload.maximum_size=4096
tinyAVR012_noloader.menu.01_variant.A1=tinyAVR-0 8pin ATtiny402 (4KiB+256B)
tinyAVR012_noloader.menu.01_variant.A2.build.board=AVR_ATTINY202
tinyAVR012_noloader.menu.01_variant.A2.build.led_pin=-DLED_BUILTIN=PIN_PA3
tinyAVR012_noloader.menu.01_variant.A2.build.mcu=attiny202
tinyAVR012_noloader.menu.01_variant.A2.build.variant=tinyAVR0_8
tinyAVR012_noloader.menu.01_variant.A2.upload.maximum_data_size=128
tinyAVR012_noloader.menu.01_variant.A2.upload.maximum_size=1536
tinyAVR012_noloader.menu.01_variant.A2=tinyAVR-0 8pin ATtiny202 (2KiB+128B)
tinyAVR012_noloader.menu.02_clock.01_20MHz.bootloader.bod_sample=0
tinyAVR012_noloader.menu.02_clock.01_20MHz.build.f_cpu=20000000L
tinyAVR012_noloader.menu.02_clock.01_20MHz=Internal 20 MHz
tinyAVR012_noloader.menu.02_clock.02_10MHz.bootloader.bod_sample=0
tinyAVR012_noloader.menu.02_clock.02_10MHz.build.f_cpu=10000000L
tinyAVR012_noloader.menu.02_clock.02_10MHz=Internal 10 MHz
tinyAVR012_noloader.menu.02_clock.03_5MHz.bootloader.bod_sample=0
tinyAVR012_noloader.menu.02_clock.03_5MHz.build.f_cpu=5000000L
tinyAVR012_noloader.menu.02_clock.03_5MHz=Internal 5 MHz
tinyAVR012_noloader.menu.02_clock.10=-
tinyAVR012_noloader.menu.02_clock.11_16MHz.bootloader.OSCCFG=0b00000001
tinyAVR012_noloader.menu.02_clock.11_16MHz.bootloader.bod_sample=0
tinyAVR012_noloader.menu.02_clock.11_16MHz.build.f_cpu=16000000L
tinyAVR012_noloader.menu.02_clock.11_16MHz=Internal 16 MHz
tinyAVR012_noloader.menu.02_clock.12_8MHz.bootloader.OSCCFG=0b00000001
tinyAVR012_noloader.menu.02_clock.12_8MHz.bootloader.bod_sample=0
tinyAVR012_noloader.menu.02_clock.12_8MHz.build.f_cpu=8000000L
tinyAVR012_noloader.menu.02_clock.12_8MHz=Internal 8 MHz
tinyAVR012_noloader.menu.02_clock.13_4MHz.bootloader.OSCCFG=0b00000001
tinyAVR012_noloader.menu.02_clock.13_4MHz.bootloader.bod_sample=0
